Network Working Group                                      Dayong Guo 
Internet Draft                                    Sheng Jiang (Editor) 
Intended status: Standards Track          Huawei Technologies Co., Ltd 
Expires: October 18, 2012                                  R. Despres 
                                                            RD-IPtech 
                                                          R. Maglione 
                                                        Telecom Italia 
                                                        April 18, 2012 
                                    


                        RADIUS Attribute for 6rd 
                                    
              draft-ietf-softwire-6rd-radius-attrib-05.txt 


Status of this Memo 

   This Internet-Draft is submitted in full conformance with the 
   provisions of BCP 78 and BCP 79. 

   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF). Note that other groups may also distribute working 
   documents as Internet-Drafts. The list of current Internet-Drafts is 
   at http://datatracker.ietf.org/drafts/current/. 

   Internet-Drafts are draft documents valid for a maximum of six months 
   and may be updated, replaced, or obsoleted by other documents at any 
   time. It is inappropriate to use Internet-Drafts as reference 
   material or to cite them other than as "work in progress." 

   This Internet-Draft will expire on October 18, 2012. 

Copyright Notice 

   Copyright (c) 2012 IETF Trust and the persons identified as the 
   document authors. All rights reserved. 

   This document is subject to BCP 78 and the IETF Trust's Legal 
   Provisions Relating to IETF Documents 
   (http://trustee.ietf.org/license-info) in effect on the date of 
   publication of this document. Please review these documents 
   carefully, as they describe your rights and restrictions with respect 
   to this document. Code Components extracted from this document must 
   include Simplified BSD License text as described in Section 4.e of 
   the Trust Legal Provisions and are provided without warranty as 
   described in the Simplified BSD License. 



 
 
 
Jiang, et al.         Expires October 18, 2012                [Page 1] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

    

Abstract 

   IPv6 Rapid Deployment (6rd) is one of the most popular methods to 
   provide both IPv4 and IPv6 connectivity services simultaneously 
   during the IPv4/IPv6 co-existing period. The Dynamic Host 
   Configuration Protocol (DHCP) 6rd option has been defined to 
   configure 6rd Customer Edge (CE). However, in many networks, the 
   configuration information may be stored in Authentication 
   Authorization and Accounting (AAA) servers while user configuration 
   is mainly from Broadband Network Gateway (BNG) through DHC protocol. 
   This document defines a Remote Authentication Dial In User Service 
   (RADIUS) attribute that carries 6rd configuration information from 
   AAA server to BNG. 

    

Table of Contents 

   1. Introduction ................................................ 3 
   2. Terminology ................................................. 3 
   3. IPv6 6rd Configuration with RADIUS .......................... 3 
   4. Attributes .................................................. 5 
      4.1. IPv6-6rd-Configuration Attribute ....................... 5 
      4.2. Table of attributes .................................... 8 
   5. Diameter Considerations ..................................... 8 
   6. Security Considerations ..................................... 8 
   7. IANA Considerations ......................................... 9 
   8. Acknowledgments ............................................. 9 
   9. References .................................................. 9 
      9.1. Normative References ................................... 9 
      9.2. Informative References ................................ 10 
    












 
 
Jiang, et al.         Expires October 18, 2012                [Page 2] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

    
1. Introduction 

   Recently providers start to deploy IPv6 and consider how to transit 
   to IPv6. IPv6 Rapid Deployment (6rd) [RFC5969] is one of the most 
   popular methods to provide both IPv4 and IPv6 connectivity services 
   simultaneously during the IPv4/IPv6 co-existing period. 6rd is used 
   to provide IPv6 connectivity service through legacy IPv4-only 
   infrastructure. 6rd adopt Dynamic Host Configuration Protocol (DHCP) 
   as auto-configuring protocol. The 6rd Customer Edge (CE) uses the 
   DHCP extension option to discover 6rd border relay and to configure 
   IPv6 prefix and address. 

   In many networks, user configuration information may be managed by 
   AAA (Authentication, Authorization, and Accounting) servers. Current 
   AAA servers communicate using the Remote Authentication Dial In User 
   Service (RADIUS) [RFC2865] protocol. 
   In a fixed line broadband network, the Broadband Network Gateways 
   (BNGs) act as the access gateway of users. The BNGs are assumed to 
   embed a DHCP server function that allows them to locally handle any 
   DHCP requests issued by hosts. 

   Since the 6rd configuration information is stored in AAA servers and 
   user configuration is mainly through DHC protocol between BNGs and 
   hosts/CEs, new RADIUS attributes are needed to propagate the 
   information from AAA servers to BNGs. 

2. Terminology 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in RFC2119 [RFC2119]. 

   The terms 6rd CE and 6rd Border Relay are defined in [RFC5969]. 

3. IPv6 6rd Configuration with RADIUS 

   The below Figure 1 illustrates how the RADIUS protocol and DHCP 
   cooperate to provide 6rd CE with 6rd configuration information. 







 
 
Jiang, et al.         Expires October 18, 2012                [Page 3] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

      6rd CE                       BNG                       AAA Server 
         |                          |                             | 
         |-------DHCPDISCOVER------>|                             | 
         |                          |--Access-Request(6rd Attr)-->| 
         |                          |                             | 
         |                          |<--Access-Accept(6rd Attr)---| 
         |<-------DHCPOFFER---------|                             | 
         |                          |                             | 
         |--------DHCPREQUEST------>|                             | 
         |      (6rd Option)        |                             | 
         |<--------DHCPACK----------|                             | 
         |      (6rd option)        |                             | 
         |                          |                             | 
                   DHCP                         RADIUS  
                Figure 1: the cooperation between DHCP and RADIUS 

   BNGs act as a client of RADIUS and as a DHCP server for DHC protocol. 
   First, a BNG receives a DHCPDISCOVER from the 6rd CE. It initiates 
   the BNG to request correspondent user authentication relevant from an 
   AAA server using RADIUS protocol. A 6rd configuration request may 
   also be sent in the same message. If the user authentication is 
   approved by the AAA server, an Access-Accept message is acknowledged 
   with the IPv6-6rd-Configuration Attribute, defined in the next 
   Section. After the BNG responds to the user with an Advertise  
   message, the user requests for a 6rd Option. Then, the BNG can reply 
   the user using the DHC protocol. 

   In the abovementioned scenario, the Access-Request packet contains a 
   Service-Type attribute with the value Authorize Only (17), thus 
   according to [RFC5080] the Access-Request packet MUST contain a State 
   attribute. 

   Figure 2 describes another scenario, in which the authentication 
   operation is not coupled with DHCP. In the authentication stage, the 
   BNG obtains the 6rd configuration information from the AAA server 
   through the RADIUS protocol. When the user requests the 6rd Option, 
   the BNG replies with a 6rd option in DHCPACK. 









 
 
Jiang, et al.         Expires October 18, 2012                [Page 4] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

      6rd CE                       BNG                       AAA Server 
         |                          |                             | 
         |                          |--Access-Request(6rd Attr)-->| 
         |                          |                             | 
         |                          |<--Access-Accept(6rd Attr)---| 
         |                          |                             | 
         |--------DHCPREQUEST------>|                             | 
         |      (6rd Option)        |                             | 
         |<---------DHCPACK---------|                             | 
         |      (6rd option)        |                             | 
         |                          |                             | 
                   DHCP                         RADIUS  
                Figure 2: the cooperation between DHCP and RADIUS 

   After receiving the IPv6-6rd-Configuration Attribute in the initial 
   Access-Accept, the BNG MUST store the received 6rd configuration 
   parameters locally. When the 6rd CE sends a DHCP Request message to 
   request an extension of the lifetimes for the assigned address, the 
   BNG does not have to initiate a new Access-Request towards the AAA 
   server to request the 6rd configuration parameters. The BNG retrieves 
   the previously stored 6rd configuration parameters and use them in 
   its reply. 

   If the DHCP server to which the DHCP Request message was sent at time 
   T1 has not responded, the DHCP client enters the REBINDING state and 
   attempts to contact any server. In this scenario the BNG receiving 
   the DHCP message MUST initiate a new Access-Request towards the AAA 
   server. The BNG MAY include the IPv6-6rd-Configuration Attribute in 
   its Access-Request. If the BNG does not receive the IPv6-6rd-
   Configuration Attribute in the Access-Accept it MAY fallback to a 
   pre-configured default 6rd configuration, if any. If the BNG does not 
   have any pre-configured default 6rd configuration or if the BNG 
   receives an Access-Reject, the tunnel cannot be established. 

4. Attributes 

   This section defines IPv6-6rd-Configuration Attribute which is used 
   in the 6rd scenario. The attribute design follows [RFC6158]. 

4.1. IPv6-6rd-Configuration Attribute 

   The IPv6-6rd-Configuration Attribute is structured as follows (The 
   specification requires that multiple IPv4 addresses are associated 
   strongly with one IPv6 prefix. Given that RADIUS currently has no 
   recommended way of grouping multiple attributes, the below design 
   appears to be a reasonable compromise.): 

 
 
Jiang, et al.         Expires October 18, 2012                [Page 5] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

    0                   1                   2                   3 
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |      Type     |    Length     |    SubType    |    SubLen     | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   | IPv4MaskLen   |    SubType    |    SubLen     |  Reserved     | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |  6rdPrefixLen |                                               | 
   +-+-+-+-+-+-+-+-+                                               + 
   |                                                               | 
   +                                                               + 
   |                     6rdPrefix                                 | 
   +                                                               + 
   |                                                               | 
   +               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |               |   SubType     |    SubLen     |6rdBRIPv4Address| 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |             6rdBRIPv4Address                  | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

       Type 

         TBD 

       Length 

         25 + n*6 (the length of the entire attribute in octets; n 
         stands the number of BR IPv4 addresses, minimum n is 1). 

       SubType 

         1 (SubType number, for the IPv4 Mask Length suboption) 

       SubLen 

         3 (the length of the IPv4 Mask Length suboption) 

       IPv4MaskLen 

         The number of high-order bits that are identical across all CE 
         IPv4 addresses within a given 6rd domain. This may be any value 
         between 0 and 32. Any value greater than 32 is invalid. 

       SubType 

         2 (SubType number, for the 6rd prefix suboption) 

 
 
Jiang, et al.         Expires October 18, 2012                [Page 6] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

       SubLen 

         20 (the length of the 6rd prefix suboption) 

       Reserved 

         Set to be all 0 for now. Reserved for the future use. To be 
         compatible with other IPv6 prefix attributes in the Radius 
         Protocol. 

       6rdPrefixLen 

         The IPv6 Prefix length of the Service Provider's 6rd IPv6 
         prefix in number of bits. The 6rdPrefixLen MUST be less than or 
         equal to 128. 

       6rdPrefix 

         The Service Provider's 6rd IPv6 prefix represented as a 16 
         octet IPv6 address. The bits after the 6rdPrefixlen number of 
         bits in the prefix SHOULD be set to zero. 

       SubType 

         3 (SubType number, for the 6rd Border Relay IPv4 address 
         suboption) 

       SubLen 

         6 (the length of the 6rd Border Relay IPv4 address suboption) 

       6rdBRIPv4Address 

         One or more IPv4 addresses of the 6rd Border Relay(s) for a 
         given 6rd domain. The maximum RADIUS Attribute length of 255 
         octets results in a limit of 58 IPv4 addresses. 

   The IPv6-6rd-Configuration Attribute MAY be used in Access-Request 
   packets as a hint to the RADIUS server; for example if the BNG is 
   pre-configured with a default 6rd configuration, these parameters MAY 
   be inserted in the attribute. The RADIUS server MAY ignore the hint 
   sent by the BNG and it MAY assign different 6rd parameters. 

   If the BNG includes the IPv6-6rd-Configuration Attribute, but the AAA 
   server does not recognize it, this attribute MUST be ignored by the 
   AAA Server. 

 
 
Jiang, et al.         Expires October 18, 2012                [Page 7] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

   If the BNG does not receive IPv6-6rd-Configuration Attribute in the 
   Access-Accept it MAY fallback to a pre-configured default 6rd 
   configuration, if any. If the BNG does not have any pre-configured 
   default 6rd configuration, the 6rd tunnel can not be established. 

   If the BNG is pre-provisioned with a default 6rd configuration and 
   the 6rd configuration received in Access-Accept is different from the 
   configured default, then the 6rd configuration received in the 
   Access-Accept message MUST be used for the session. 

   If the BNG cannot support the received 6rd configuration for any 
   reason, the tunnel SHOULD NOT be established. 

4.2. Table of attributes 

   The following table provides a guide to which attributes may be found 
   in which kinds of packets, and in what quantity. 

   Request Accept Reject Challenge Accounting  #  Attribute 
                                    Request 
    0-1     0-1     0      0         0-1      TBD  IPv6-6rd- 
                                                   Configuration 

   The following table defines the meaning of the above table entries. 

   0     This attribute MUST NOT be present in packet. 
   0+    Zero or more instances of this attribute MAY be present in 
         packet. 
   0-1   Zero or one instance of this attribute MAY be present in 
         packet. 
   1     Exactly one instance of this attribute MUST be present in 
         packet. 

5. Diameter Considerations 

   This attribute is usable within either RADIUS or Diameter [RFC3588]. 
   Since the Attributes defined in this document will be allocated from 
   the standard RADIUS type space, no special handling is required by 
   Diameter entities. 

6. Security Considerations 

   In 6rd scenarios, the RADIUS protocol is run over IPv4. Known 
   security vulnerabilities of the RADIUS protocol are discussed in RFC 
   2607 [RFC2607], RFC 2865 [RFC2865], and RFC 2869 [RFC2869]. Use of 
   IPsec [RFC4301] for providing security when RADIUS is carried in IPv6 
   is discussed in RFC 3162 [RFC3162]. 
 
 
Jiang, et al.         Expires October 18, 2012                [Page 8] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

   Security considerations for the Diameter protocol are discussed in 
   RFC 3588 [RFC3588]. 

7. IANA Considerations 

   This document requires the assignment of one new RADIUS Attribute 
   Types in the "Radius Types" registry (currently located at 
   http://www.iana.org/assignments/radius-types for the following 
   attributes: 

      o  IPv6-6rd-Configuration 

   IANA should allocate the number from the standard RADIUS Attributes 
   space using the "IETF Review" policy [RFC5226]. 

8. Acknowledgments 

   The authors would like to thank Maglione Roberta, Alan DeKok, for 
   valuable comments. 

9. References 

9.1. Normative References 

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate 
             Requirement Levels", BCP 14, RFC 2119, March 1997. 

   [RFC2865] Rigney, C., Willens, S., Rubens, A., and W. Simpson, 
             "Remote Authentication Dial In User Service (RADIUS)", RFC 
             2865, June 2000. 

   [RFC3162] Aboba, B., Zorn, G., and D. Mitton, "RADIUS and IPv6", RFC 
             3162, August 2001. 

   [RFC3588] Calhoun, P., Loughney, J., Guttman, E., Zorn, G., and J., 
             Arkko, "Diameter Base Protocol", RFC 3588, September 2003. 

   [RFC4301] Kent, S. and K. Seo, "Security Architecture for the 
             Internet Protocol", RFC 4301, December 2005. 

   [RFC5080] Nelson, D. and DeKok A., "Common Remote Authentication Dial 
             In User Service (RADIUS) Implementation Issues and 
             Suggested Fixes", RFC 5080, December 2007. 

   [RFC5226] Narten, T. and H. Alvestrand, "Guidelines for Writing an 
             IANA Considerations Section in RFCs", RFC 5226, May 2008. 

 
 
Jiang, et al.         Expires October 18, 2012                [Page 9] 

Internet-Draft draft-ietf-softwire-6rd-radius-attrib-05      April 2012 
    

   [RFC5969] Townsley, M. and O. Troan, "IPv6 Rapid Deployment on IPv4 
             Infrastructures (6rd) -- Protocol Specification", RFC5969, 
             August 2010. 

   [RFC6158] DeKok, A. and G. Weber, "RADIUS Design Guidelines", RFC 
             6158, March 2011. 

9.2. Informative References 

   [RFC2607] Aboba, B. and J. Vollbrecht, "Proxy Chaining and Policy 
             Implementation in Roaming", RFC 2607, June 1999. 

   [RFC2869] Rigney, C., Willats, W., and P. Calhoun, "RADIUS 
             Extensions", RFC 2869, June 2000. 

    

   Author's Addresses 

   Dayong Guo 
   Huawei Technologies Co., Ltd 
   Q14 Huawei Campus, 156 BeiQi Road, 
   ZhongGuan Cun, Hai-Dian District, Beijing 100095 
   P.R. China 
   Email: guoseu@huawei.com 
    
   Sheng Jiang (Editor) 
   Huawei Technologies Co., Ltd 
   Q14 Huawei Campus, 156 BeiQi Road, 
   ZhongGuan Cun, Hai-Dian District, Beijing 100095 
   P.R. China 
   Email: jiangsheng@huawei.com 
    
   Remi Despres 
   RD-IPtech 
   3 rue du President Wilson 
   Levallois, 
   France 
   Email: despres.remi@laposte.net 
    
   Roberta Maglione 
   Telecom Italia 
   Via Reiss Romoli 274 
   Torino 10148 
   Italy 
   Email: roberta.maglione@telecomitalia.it 

 
 
Jiang, et al.         Expires October 18, 2012               [Page 10] 